insert into genres (name)
values ('folk'),('rock'),('rap'),('heavy metal');

insert into executors (name)
values ('Ёж'),('Ночная стража'),('Копыто инженера'),('Ошпаренный тролль');

insert into albums (name, year_of_issue)
values ('Анк-Морпорк', 2019),('Гордая птица', 2020),('Шмяк', 2018),('Четвертый эльфийский', 2021),('Гори, Москва', 2018);

insert into collections (name, year_of_issue)
values ('Суповой набор', 2022),('Душный', 2020),('Фентезя', 2021),('Лиходеи', 2019),('18+', 2020);

insert into treks (name, duration, album_id)
values ('Камнелиц', 419, 1),('Шнобби', 205, 1),('Дракон', 119, 1),('Патриций', 304, 1),('Песня про ёжика', 312, 2),('Укуси меня за плинтус', 216, 2),('Велосипедная мышь', 312, 2),('Мой бой', 115, 2),('Полёт', 123, 2),('Иешуа, ты не прав!', 316, 5),('Свита играет короля', 403, 5),('Масло на брусчатке', 124, 5),('Роковые яйца', 204, 5),('Огонь', 301, 5),('Король?', 301, 3),('Шмяк', 201, 3),('Долина Кум', 129, 3),('Дело табак', 207, 3),('Шнобская удалая', 300, 3),('Бей первым', 109, 4),('Жри!', 208, 4),('Круши!', 105, 4),('Купание тролля', 311, 4),('Коричневый снег', 112, 4) ;

insert into trekscollections  (trek_id, collection_id)
values (2, 1),(6, 1),(7, 1),(21, 1),(1,2),(4, 2),(8, 2),(10, 2),(3, 3),(11, 3),(15, 3),(24, 3),(2, 4),(4, 4),(12, 4),(13, 4),(5, 5),(13,5),(24, 5),(23, 5) ;

insert into executorsgenes  (genre_id, executor_id)
values (1, 2),(2, 2),(4, 2),(3, 1),(3,3),(1, 3),(2, 4),(3, 4);

insert into executorsalbums  (album_id, executor_id)
values (1, 2),(2, 1),(4, 2),(3, 2),(4,4),(5, 3);








